Repository: wescamp/Dungeon_Wars_Creepfest-1.8
Catalog: po/*.po
Languages: cs, hu

source: 2p - DW Creepfest
cs: 2p - KV Potvorplná
hu: 2j - BH Szörnyek fesztiválja

source: Medium 1v1 map set in a decaying land. Recruit optional creeps to aid your cause!
cs: Středně velká mapa zničené země pro bitvu 1 vs 1. Pro dosažení cíle lze verbovat rozličné potvůrky!
hu: Közepes 1v1 pálya egy pusztuló földön. Toborozz szörnyeket, hogy segítsenek a csatában!

source: teamname^West
cs: Západní
hu: Nyugat

source: teamname^East
cs: Východní
hu: Kelet

source: Giant Mudcrawler
cs: Obří blátožrout
hu: Óriás sártipró

source: Wolf
cs: Vlk
hu: Farkas

source: Giant Scorpion
cs: Obří škorpion
hu: Óriás skorpió

source: Ogre
cs: Obr

source: Troll Shaman
cs: Trollí šaman
hu: Troll Sámán

source: Chocobone
cs: Kostipštros
hu: Csontlovas

source: Giant Spider
cs: Obří pavouk
hu: Óriáspók

source: Yeti
cs: Yetti
hu: Jeti

source: Monster Shop Leaders only!
cs: Příšerkoloniál Pouze pro vůdce!
hu: Szörny bolt Vezéreknek!

source: Bought monsters start here!
cs: Zakoupená monstra vylézají tady!
hu: A vásárolt szörnyek kezdő helye.

source: Defeat enemy player's leader
cs: Poraz nepřátelského vůdce
hu: Legyőzöd az ellenfél vezérét

source: Death of your leader
cs: Tvůj vůdce zemře
hu: Vezéred elesik

source: <b>Enter shops with leaders to buy optional monsters. Monsters can be neutral for half the price. Step on runes to open/close walls.</b>
cs: <b>Vůdci mohou v obchodech nakupovat volitelná monstra. Za poloviční cenu lze nakoupit neutrální monstra. Stoupání na runy otvírá/zavírá stěny.</b>
hu: <b>Lépj be a boltba a vezéreddel, hogy szörnyeket vegyél! A semleges szörnyek feleannyiba kerülnek. Lépj a rúnákra, hogy kinyisd, illetve bezárd a falakat!</b>

source: DUNGEON WARS CREEPFEST Created by : Kvinkunx Main testing and suggestions : Rigor ( thanks, man! :) ) <b><big><span foreground='orange'>THIS IS A STANDARD BATTLE, RECRUIT YOUR REGULAR ARMY FIRST!</span></big></b> Enter a shop with your <b>LEADER</b> to recruit monsters in northern and southern dungeon. The farther from your home castle you want them to appear, the more you have to pay. You can pay full price for ownership of the monster or you can just spawn a neutral monster at a discount. Step on magical runes with <b>ANY UNIT</b> to open/close walls. Only then the bought monsters can leave the dungeon and join the battle! Be careful, if a unit stands on a wall hex and someone closes the wall again, the unit is killed. Entering a shop or stepping on a rune won't end the movement of a unit!
cs: KOBKOVÁ VÁLKA POTVORPLNÁ Autor : Kvinkunx Hlavní testování a nápady : Rigor (díky, babochlape! :) ) (překladatelský vtip) <b><big><span foreground='orange'>TOTO JE STANDARDNÍ BITVA, NEJDŘÍVE SI NAVERBUJ KLASICKOU ARMÁDU!</span></big></b> Pokud si chceš do severního nebo jižního podzemí naverbovat monstra, navštiv se svým <b>VŮDCEM</b> obchod. Čím dále od svého domovského hradu budeš chtít aby se objevovala, tím víc za ně musíš zaplatit. Můžeš zaplatit plnou cenu a budeš je ovládat nebo zaplatíš jen část a budou se oživovat jako neutrální. <b>JAKÁKOLIV JEDNOTKA</b>, která šlápne na magickou runu, otevře nebo zavře stěnu. Jedině tak mohou nakoupená monstra opustit podzemí a připojit se do bitvy! Měj na paměti, že když jednotka stojí na hexu stěny a někdo stěnu zavře, jednotka zemře. Návštěva obchodu nebo šlápnutí na runu neukončuje pohyb jednotky!
hu: Börtön Háborúk Szörny fesztiválja Készítette : Kvinkunx Tesztelés és javaslatok : Rigor ( köszi, haver! :) ) <b><big><span foreground='orange'>EZ EGY RENDES CSATA, TOBOROZZ CSAPATOKAT ELŐSZÖR!</span></big></b> Lépj a <b>VEZÉREDDEL</b> a boltra, hogy szörnyeket toborozz az északi és déli börtönbe. Minnél messebb akarod letenni őket a kastélyodtól, annál többet kell fizetned értük. Teljes árat kell fizetned, ha irányítani akarod a szörnyet, de ha csak egy semleges szörnyet akarsz, akkor az kevesebbe kerül. Lépj a rúnákra <b>BÁRMELYIK EGYSÉGGEL</b>, hogy kinyisd, vagy becsukd a falakat! Ezután hagyhatja el a szörny a börtönt és csatlakozhat a csatához. Légy óvatos, ha egy egység a fal helyén áll, és valaki azt becsukja, akkor az egység meghal. A boltra vagy a rúnákra lépett egység nem veszíti el a további lépéseit!

source: Open Sesame!
cs: Sezame, otevři se!
hu: Szezám, tárulj!

source: Sesame, close!
cs: Sezame, zavři se!
hu: Szezám, zárulj!

source: TOP CENTRAL
cs: HORNÍ PROSTŘEDNÍ
hu: ÉSZAK

source: YOU
cs: TVÁ VŮLE
hu: TE

source: Marisha's Monster Emporium
cs: Bestiální tržnice MarišaLand
hu: Marisha Szörny Áruháza

source: <span foreground='yellow'>Gold: $gold Total price: $total_price</span> You are buying this monster: <span foreground='red'>$chosen_name</span> It will appear at this trapdoor: <span foreground='magenta'>$trapdoor_name</span> The controller of the monster will be: <span foreground='cyan'>$owner_name
cs: <span foreground='yellow'>Zlatých: $gold Celková cena: $total_price</span> Nakupuješ toto monstrum: <span foreground='red'>$chosen_name</span> Objeví se u těchto padacích dvířek: <span foreground='magenta'>$trapdoor_name</span> Toto monstrum bude ovládat: <span foreground='cyan'>$owner_name
hu: <span foreground='yellow'>Arany: $gold Ár: $total_price</span> Ezt a szörnyet veszed meg: <span foreground='red'>$chosen_name</span> Ennél a csapóajtónál jelenik meg: <span foreground='magenta'>$trapdoor_name</span> A szörny irányítója: <span foreground='cyan'>$owner_name

source: Don't buy anything.
cs: Nekupuji nic.
hu: Nem veszek semmit.

source: Choose monster type!
cs: Vyber typ monstra!
hu: Válassz szörnyet!

source: Monsters
cs: Monstra
hu: Szörnyek

source: <span foreground='yellow'>Gold: $gold|</span>
cs: <span foreground='yellow'>Zlatých: $gold|</span>
hu: <span foreground='yellow'>Arany: $gold|</span>

source: <span foreground='red'>$name_mud|</span> : <span foreground='yellow'>12gp</span> Hitpoints:36 Moves:4 7 - 2 melee (impact) 5 - 3 ranged (impact)
cs: <span foreground='red'>$name_mud|</span> : <span foreground='yellow'>12 zl</span> Životů:36 Pohyby:4 7 - 2 zblízka (úder) 5 - 3 na dálku (úder)
hu: <span foreground='red'>$name_mud|</span> : <span foreground='yellow'>12gp</span> Ép:36 Lépés:4 7 - 2 közelharc (ütés) 5 - 3 távolsági harc (ütés)

source: <span foreground='red'>$name_wolf|</span> : <span foreground='yellow'>13gp</span> Hitpoints:32 Moves:8 5 - 3 melee (blade)
cs: <span foreground='red'>$name_wolf|</span> : <span foreground='yellow'>13 zl</span> Životů:32 Pohyby:8 5 - 3 zblízka (čepel)
hu: <span foreground='red'>$name_wolf|</span> : <span foreground='yellow'>13gp</span> Ép:32 Lépés:8 5 - 3 közelharc (vágás)

source: <span foreground='red'>$name_scorpy|</span> : <span foreground='yellow'>17gp</span> Hitpoints:40 Moves:8 9 - 1 melee (pierce) (poison) 4 - 4 melee (impact)
cs: <span foreground='red'>$name_scorpy|</span> : <span foreground='yellow'>17 zl</span> Životů:40 Pohyby:8 9 - 1 zblízka (bodnutí) (otrava) 4 - 4 zblízka (úder)
hu: <span foreground='red'>$name_scorpy|</span> : <span foreground='yellow'>17gp</span> Ép:40 Lépés:8 9 - 1 közelharc (szúrás) (méreg) 4 - 4 közelharc (ütés)

source: <span foreground='red'>$name_ogre|</span> : <span foreground='yellow'>33gp</span> Hitpoints:68 Moves:5 10 - 3 melee (blade)
cs: <span foreground='red'>$name_ogre|</span> : <span foreground='yellow'>33 zl</span> Životů:68 Pohyby:5 10 - 3 zblízka (čepel)
hu: <span foreground='red'>$name_ogre|</span> : <span foreground='yellow'>33gp</span> Ép:68 Lépés:5 10 - 3 közelharc (vágás)

source: <span foreground='red'>$name_shaman|</span> : <span foreground='yellow'>32gp</span> Hitpoints:50 Moves:5 regenerates 7 - 2 melee (impact) 7 - 3 ranged (fire) (magical)
cs: <span foreground='red'>$name_shaman|</span> : <span foreground='yellow'>32 zl</span> Životů:50 Pohyby:5 regenerace 7 - 2 zblízka (úder) 7 - 3 na dálku (oheň) (magický)
hu: <span foreground='red'>$name_shaman|</span> : <span foreground='yellow'>32gp</span> Ép:50 Lépés:5 regenerálódás 7 - 2 közelharc (ütés) 7 - 3 távolsági harc (tűz) (mágikus)

source: <span foreground='red'>$name_choco|</span> : <span foreground='yellow'>29gp</span> Hitpoints:45 Moves:9 submerge 9 - 2 melee (pierce) (charge)
cs: <span foreground='red'>$name_choco|</span> : <span foreground='yellow'>29 zl</span> Životů:45 Pohyby:9 ponoření 9 - 2 zblízka (bodnutí) (výpad)
hu: <span foreground='red'>$name_choco|</span> : <span foreground='yellow'>29gp</span> Ép:45 Lépés:9 alámerülés 9 - 2 közelharc (szúrás) (roham)

source: <span foreground='red'>$name_spidey|</span> : <span foreground='yellow'>60gp</span> Hitpoints:54 Moves:6 18 - 2 melee (blade) (poison) 8 - 3 ranged (impact) (slows)
cs: <span foreground='red'>$name_spidey|</span> : <span foreground='yellow'>60 zl</span> Životů:54 Pohyby:6 18 - 2 zblízka (čepel) (otrava) 8 - 3 na dálku (úder) (zpomalení)
hu: <span foreground='red'>$name_spidey|</span> : <span foreground='yellow'>60gp</span> Ép:54 Lépés:6 18 - 2 közelharc (vágás) (méreg) 8 - 3 távolsági harc (ütés) (lassítás)

source: <span foreground='red'>$name_yeti|</span> : <span foreground='yellow'>100gp</span> Hitpoints:142 Moves:5 32 - 2 melee (impact)
cs: <span foreground='red'>$name_yeti|</span> : <span foreground='yellow'>100 zl</span> Životů:142 Pohyby:5 32 - 2 zblízka (úder)
hu: <span foreground='red'>$name_yeti|</span> : <span foreground='yellow'>100gp</span> Ép:142 Lépés:5 32 - 2 közelharc (ütés)

source: Where should the monster appear?
cs: Kde se má monstrum objevit?
hu: Hol jelenjen meg a szörny?

source: Spawning Point
cs: Místo zrodu
hu: Megjelenési hely

source: <span foreground='magenta'>Top left trapdoor</span> Price will change to $left_trapdoors|% of the monster cost.
cs: <span foreground='magenta'>Horní levá padací dvířkar</span> Výsledná cena monstra bude $left_trapdoors|% ceny původní.
hu: <span foreground='magenta'>Északnyugati csapóajtó</span> Az ár $left_trapdoors|%-a lesz a szörny árának.

source: TOP LEFT
cs: HORNÍ LEVÁ
hu: ÉSZAKNYUGAT

source: <span foreground='magenta'>Bottom left trapdoor</span> Price will change to $left_trapdoors|% of the monster cost.
cs: <span foreground='magenta'>Spodní levá padací dvířka</span> Výsledná cena monstra bude $left_trapdoors|% ceny původní.
hu: <span foreground='magenta'>Délnyugati csapóajtó</span> Az ár $left_trapdoors|%-a lesz a szörny árának.

source: BOTTOM LEFT
cs: SPODNÍ LEVÁ
hu: DÉLNYUGAT

source: <span foreground='magenta'>Top central trapdoor</span> Price will change to $central_trapdoors|% of the monster cost.
cs: <span foreground='magenta'>Horní prostřední padací dvířka</span> Výsledná cena monstra bude $central_trapdoors|% ceny původní.
hu: <span foreground='magenta'>Északi csapóajtó</span> Az ár $central_trapdoors|%-a lesz a szörny árának.

source: <span foreground='magenta'>Bottom central trapdoor</span> Price will change to $central_trapdoors|% of the monster cost.
cs: <span foreground='magenta'>Spodní prostřední padací dvířka</span> Výsledná cena monstra bude $central_trapdoors|% ceny původní.
hu: <span foreground='magenta'>Déli csapóajtó</span> Az ár $central_trapdoors|%-a lesz a szörny árának.

source: BOTTOM CENTRAL
cs: SPODNÍ PROSTŘEDNÍ
hu: DÉL

source: <span foreground='magenta'>Top right trapdoor</span> Price will change to $right_trapdoors|% of the monster cost.
cs: <span foreground='magenta'>Horní pravá padací dvířka</span> Výsledná cena monstra bude $right_trapdoors|% ceny původní.
hu: <span foreground='magenta'>Északkeleti csapóajtó</span> Az ár $right_trapdoors|%-a lesz a szörny árának.

source: TOP RIGHT
cs: HORNÍ PRAVÁ
hu: ÉSZAKKELET

source: <span foreground='magenta'>Bottom right trapdoor</span> Price will change to $right_trapdoors|% of the monster cost.
cs: <span foreground='magenta'>Spodní pravá padací dvířka</span> Výsledná cena monstra bude $right_trapdoors|% ceny původní.
hu: <span foreground='magenta'>Délkeleti csapóajtó</span> Az ár $right_trapdoors|%-a lesz a szörny árának.

source: BOTTOM RIGHT
cs: SPODNÍ PRAVÁ
hu: DÉLKELET

source: Who will control this monster?
cs: Kdo bude pánem tohoto monstra?
hu: Ki irányítsa ezt a szörnyet?

source: Ownership
cs: Vlastnictví
hu: Tulajdonos

source: <span foreground='yellow'>Pay only half the price!</span> <span foreground='cyan'>It may attack anyone at will though, even you!!</span>
cs: <span foreground='yellow'>Za polovic!</span> <span foreground='cyan'>Monstrum bude útočit dle své vůle, třeba i na tebe!!</span>
hu: <span foreground='yellow'>A fele árat fizetem!</span> <span foreground='cyan'>Bár így még engem is megtámadhat!!</span>

source: AI! It may attack anyone, even you!!
cs: AI! Může útočit na kohokoli včetně tebe!!
hu: A gép! Bár így még engem is megtámadhat!!

source: <span foreground='yellow'>Full price!</span> <span foreground='cyan'>Full control of the monster you buy.</span>
cs: <span foreground='yellow'>Plná cena!</span> <span foreground='cyan'>Plná kontrola nad kupovaným monstrem.</span>
hu: <span foreground='yellow'>Teljes árat kifizetem!</span> <span foreground='cyan'>Én irányítom a szörnyet!</span>

source: Buy this monster!
cs: Kupuji ho!
hu: Megveszem ezt a szörnyet!

source: Marisha
cs: Mariša

source: <span foreground='orange'>You don't have the required money! Begone!!</span>
cs: <span foreground='orange'>Nemáš dostatek peněz! Vypadni!!</span>
hu: <span foreground='orange'>Nincs elég pénzed! Távozz!!</span>

source: 2p - DW No Creeps
cs: 2p - KV Potvorprostá
hu: 2j - BH Szörnyek nélkül

source: Medium 1v1 map set in a decaying land.
cs: Středně velká mapa zničené země pro bitvu 1 vs 1.
hu: Közepes 1v1 pálya egy pusztuló földön.

source: 4p - DW Creepfest
cs: 4p - KV Potvorplná
hu: 4j - BH Szörnyek fesztiválja

source: Medium 2v2 map set in a decaying land. Recruit optional creeps to aid your cause!
cs: Středně velká mapa zničené země pro bitvu 2 vs 2. Pro dosažení cíle lze verbovat rozličné potvůrky!
hu: Közepes 2v2 pálya egy pusztuló földön. Toborozz szörnyeket, hogy segítsenek a csatában!

source: Defeat enemy players' leaders
cs: Poraz nepřátelské vůdce
hu: Legyőzöd az (összes) ellenfél vezérét

source: Death of your leaders
cs: Vůdci spřátelených vojsk zemřou
hu: Vezéred elesik

source: 4p - DW No Creeps
cs: 4p - KV Potvorprostá
hu: 4j - BH Szörnyek nélkül

source: Medium 2v2 map set in a decaying land.
cs: Středně velká mapa zničené země pro bitvu 2 vs 2.
hu: Közepes 2v2 pálya egy pusztuló földön.
